In [1]:
import numpy as np
import pandas as pd
import glob

In [2]:
df = pd.read_excel('data/student.xlsx')
df

  Student  Physics  Chemistry  English  Math
0    John       78         79       56    95
1   Alice       58         72       91    81
2  Rachel       22         61       88    64
3     Tom       78         89       56    83

In [7]:
df_melt = pd.melt(df, id_vars='Student', value_vars=['Physics', 'Math'])
df_melt

  Student variable  value
0    John  Physics     78
1   Alice  Physics     58
2  Rachel  Physics     22
3     Tom  Physics     78
4    John     Math     95
5   Alice     Math     81
6  Rachel     Math     64
7     Tom     Math     83

In [16]:
df_pivot = pd.pivot_table(df_melt, index='Student', columns='Subjects', values='value', aggfunc='mean').reset_index()
df_pivot

Subjects Student  Chemistry  English  Math  Physics
0          Alice         72       91    81       58
1           John         79       56    95       78
2         Rachel         61       88    64       22
3            Tom         89       56    83       78

In [19]:
file_name = glob.glob('data/titanic*.csv')
file_name

['data/titanic-test.csv', 'data/titanic-train.csv']

In [45]:
# df_1 = pd.read_csv('data/titanic-train.csv')
# df_2 = pd.read_csv('data/titanic-test.csv')
df_final = pd.DataFrame()
for name in file_name:
    df_temp = pd.read_csv(name)
    df_final = pd.concat([df_final, df_temp], ignore_index=True)
df_final

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,NaN
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,NaN
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0
1305,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
1306,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0
1307,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0
1308,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0

In [36]:
df_1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [37]:
df_2

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [39]:
df1 = pd.read_csv('data/employees1.csv', index_col=0)
df2 = pd.read_csv('data/employees2.csv', index_col=0)
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4     John           IT
5    Billy           HR

In [43]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
4     John           IT       2010
5    Billy           HR       2015

In [8]:
df = pd.DataFrame({'City': ['Houston', 'Austin', 'Hoover'],
                   'State': ['Texas', 'Texas', 'Alabama'],
                   'Name':['Aria', 'Penelope', 'Niko'],
                   'Mango':[4, 10, 90],
                   'Orange': [10, 8, 14], 
                   'Watermelon':[40, 99, 43],
                   'Gin':[16, 200, 34],
                   'Vodka':[20, 33, 18]},
                 columns=['City', 'State', 'Name', 'Mango', 'Orange', 'Watermelon', 'Gin', 'Vodka'])

In [9]:
df

      City    State      Name  Mango  Orange  Watermelon  Gin  Vodka
0  Houston    Texas      Aria      4      10          40   16     20
1   Austin    Texas  Penelope     10       8          99  200     33
2   Hoover  Alabama      Niko     90      14          43   34     18

In [12]:
df1 = pd.melt(df, id_vars=['City', 'State', 'Name', 'Gin', 'Vodka'], var_name='Fruit', value_name='Fruit_count')
df1

      City    State      Name  Gin  Vodka       Fruit  Fruit_count
0  Houston    Texas      Aria   16     20       Mango            4
1   Austin    Texas  Penelope  200     33       Mango           10
2   Hoover  Alabama      Niko   34     18       Mango           90
3  Houston    Texas      Aria   16     20      Orange           10
4   Austin    Texas  Penelope  200     33      Orange            8
5   Hoover  Alabama      Niko   34     18      Orange           14
6  Houston    Texas      Aria   16     20  Watermelon           40
7   Austin    Texas  Penelope  200     33  Watermelon           99
8   Hoover  Alabama      Niko   34     18  Watermelon           43

In [14]:
df2 = pd.melt(df1, id_vars=['City', 'State', 'Name', 'Fruit', 'Fruit_count'], var_name='Wine', value_name='Wine_count')
df2

       City    State      Name       Fruit  Fruit_count   Wine  Wine_count
0   Houston    Texas      Aria       Mango            4    Gin          16
1    Austin    Texas  Penelope       Mango           10    Gin         200
2    Hoover  Alabama      Niko       Mango           90    Gin          34
3   Houston    Texas      Aria      Orange           10    Gin          16
4    Austin    Texas  Penelope      Orange            8    Gin         200
5    Hoover  Alabama      Niko      Orange           14    Gin          34
6   Houston    Texas      Aria  Watermelon           40    Gin          16
7    Austin    Texas  Penelope  Watermelon           99    Gin         200
8    Hoover  Alabama      Niko  Watermelon           43    Gin          34
9   Houston    Texas      Aria       Mango            4  Vodka          20
10   Austin    Texas  Penelope       Mango           10  Vodka          33
11   Hoover  Alabama      Niko       Mango           90  Vodka          18
12  Houston    Texas      Aria      Orange           10  Vodka          20
13   Austin    Texas  Penelope      Orange            8  Vodka          33
14   Hoover  Alabama      Niko      Orange           14  Vodka          18
15  Houston    Texas      Aria  Watermelon           40  Vodka          20
16   Austin    Texas  Penelope  Watermelon           99  Vodka          33
17   Hoover  Alabama      Niko  Watermelon           43  Vodka          18